In [1]:
import pandas as pd

In [2]:
# chunksize = 100000
# dr = r'E:\jupyter\csv file kaggle ibmb rating project\archive\rating.csv'
# for chunk in pd.read_csv(dr,chunksize =chunksize ):
#     print(chunk['rating'].mean())

In [3]:
dr=pd.read_csv(r'E:\jupyter files\projects\csv file kaggle ibmb rating project\archive\rating.csv')

In [4]:
# dr1=pd.read_csv(r'E:\jupyter\csv file kaggle ibmb rating project\archive\rating.csv',skiprows=5000,nrows= 1000)

In [5]:
dr.shape

(20000263, 4)

In [6]:
dr.head(3)

   userId  movieId  rating            timestamp
0       1        2     3.5  2005-04-02 23:53:47
1       1       29     3.5  2005-04-02 23:31:16
2       1       32     3.5  2005-04-02 23:33:39

In [7]:
dr.shape

(20000263, 4)

In [8]:
dr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000263 entries, 0 to 20000262
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  object
dtypes: float64(1), int64(2), object(1)
memory usage: 610.4+ MB

In [9]:
dm=pd.read_csv(r'E:\jupyter files\projects\csv file kaggle ibmb rating project\archive\movie.csv')

In [10]:
dt=pd.read_csv(r'E:\jupyter files\projects\csv file kaggle ibmb rating project\archive\tag.csv')

In [11]:
dm.shape

(27278, 3)

In [12]:
dt.shape

(465564, 4)

In [13]:
dm.head(3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [14]:
dt.head()

   userId  movieId            tag            timestamp
0      18     4141    Mark Waters  2009-04-24 18:19:40
1      65      208      dark hero  2013-05-10 01:41:18
2      65      353      dark hero  2013-05-10 01:41:19
3      65      521  noir thriller  2013-05-10 01:39:43
4      65      592      dark hero  2013-05-10 01:41:18

In [15]:
dr.head()

   userId  movieId  rating            timestamp
0       1        2     3.5  2005-04-02 23:53:47
1       1       29     3.5  2005-04-02 23:31:16
2       1       32     3.5  2005-04-02 23:33:39
3       1       47     3.5  2005-04-02 23:32:07
4       1       50     3.5  2005-04-02 23:29:40

In [16]:
# dr.drop([columns='timestamp'],inplace=True) #learn syntax for drop or

del dr['timestamp']
del dt['timestamp']

#for deleting column 'timestamp'

In [17]:
dr.columns

Index(['userId', 'movieId', 'rating'], dtype='object')

In [18]:
dt.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [19]:
dm.columns

Index(['movieId', 'title', 'genres'], dtype='object')

# .iloc[ ]

very important function to select rows,column,multiple rows , multiple columns but on basis of 
index only

we can select sigle row and all columns...
we can selct all rows and single column....
we can select one or more particular row and column as well

eg:
basic eg:
      .iloc[0]- 0 index row with all column with display
      .iloc[0,3] s used to select a single value from a DataFrame, specifically the element
       located at row index 0 and column index 3. 
        


1 .iloc[:3, :] Selects the first 3 rows and all columns:
2 .iloc[1:4, :] Selects rows from index 1 to index 3 (note that 4 is not included, as slicing is exclusive of the end index):
3. iloc[:, 1:3] Selects all rows and columns 1 (Age) and 2 (City):
4. iloc[1:4, 0:2] Selects rows 1 to 3 and columns 0 to 1:
5. iloc[2:, 1:] Selects rows starting from index 2 and columns starting from index 1:
6..iloc[:, [0, 2]] selects all rows and only the columns at positions 0 and 2 only.
7.df.iloc[:, [0, 2]].apply(lambda x: len(x['Name']) + len(x['City']), axis=1)

In [20]:
#exapmle for understanding operation over .iloc[]
import pandas as pd

# Sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [25, 30, 35, 40, 22],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Houston']}

df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago
4      Eva   22        Houston

operations

In [21]:
df.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [22]:
df.iloc[0,2] #s used to select a single value from a DataFrame, specifically the element
             #located at row index 0 and column index 3.

'New York'

In [23]:
df.iloc[:,:]# select all column and all rows iloc

#iloc[rows start:rows end,column start:column end]

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago
4      Eva   22        Houston

In [24]:
df.iloc[1:3,:2]

#iloc[rows start:rows end,column start:column end]

      Name  Age
1      Bob   30
2  Charlie   35

In [25]:
df.iloc[:2,1:] #2 is not included

#slicing concept valid [included : not inc.]

#iloc[rows start:rows end,column start:column end]

   Age           City
0   25       New York
1   30  San Francisco

In [26]:
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago
4      Eva   22        Houston

In [28]:
df.iloc[:, [0, 2]]

#very good method 

#[start row : end row ,[column  0 and 2  (no n-1 concet its in the list) only]

#name= 0 index column
#city =2 index column

only column at index0 and index2 {no selection of column of index1}

SyntaxError: invalid syntax (3646221803.py, line 10)

advanced operation with iloc

In [29]:
#all rows but column 0 and 2 selected
#operation show only data related to age>25

df[df['Age'] > 25].iloc[:, [0, 2]]

      Name           City
1      Bob  San Francisco
2  Charlie    Los Angeles
3    David        Chicago

In [30]:
#adding len of'names' and len of 'city' in axis =1 means row operation

df.iloc[:, [0, 2]].apply(lambda x: len(x['Name']) + len(x['City']), axis=1)

0    13
1    16
2    18
3    12
4    10
dtype: int64

# .iloc[ ] completed...

**back to project movie rating

In [31]:
dm.columns

Index(['movieId', 'title', 'genres'], dtype='object')

In [32]:
dt.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [33]:
dr.columns

Index(['userId', 'movieId', 'rating'], dtype='object')

In [34]:
dr.iloc[0].index

Index(['userId', 'movieId', 'rating'], dtype='object')

In [35]:
dt.iloc[0]['userId'] #0 index pr user id kya hai

18

In [36]:
dt.head(2)

   userId  movieId          tag
0      18     4141  Mark Waters
1      65      208    dark hero

In [37]:
dt.iloc[100]['userId'] #100 index  pr user id kya hai...

121

In [38]:
'movieid' in dt.iloc[0]

False

In [39]:
'Mark Waters' in dt.iloc[0]

False

In [40]:
row_1=dt.iloc[1]

In [41]:
'Mark Waters' in dt.iloc[1]

False

In [42]:
'Mark Waters' in dt.values

True

In [43]:
dt.isnull()

        userId  movieId    tag
0        False    False  False
1        False    False  False
2        False    False  False
3        False    False  False
4        False    False  False
...        ...      ...    ...
465559   False    False  False
465560   False    False  False
465561   False    False  False
465562   False    False  False
465563   False    False  False

[465564 rows x 3 columns]

In [44]:
dt.isnull().any() 

#only one any() gives, yes missing data present in tag column

userId     False
movieId    False
tag         True
dtype: bool

dt.isnull().any().any() 

**movies.isnull()**:
         Produces a DataFrame of True/False values 
indicating missing data.output is whole data frame

**movies.isnull().any()**:
         Produces a Series of True/False values 
for each column (by default ), indicating whether there is missing data in **each column.

**movies.isnull().any().any()**:
     Returns a single True/False value 
    indicating if there is any missing data in the **entire      DataFrame.

In [45]:
dt.isnull().any().any()

#gives true if there any nan data is present in whole data frame

True

In [46]:
dt.isnull().sum() 

#it gives how many(count)NAN data is present in which column

userId      0
movieId     0
tag        16
dtype: int64

In [47]:
dt.isnull().sum().sum() 
# how much nana data is present in whole data frame..not locate on
#which column that NAN data is present.gives totaL ONLY

16

# FOR FINDING INDEX OF 
# ROWS AND COLUMN OF 
# MISSING(NAN) DATA using numpy

In [48]:
import numpy as np

# Get the row and column indices of NaN values
row_indices, col_indices = np.where(dt.isnull())
row_indices, col_indices

# in form of array gives index of rows,colum where nan is present

(array([373276, 373277, 373281, 373288, 373289, 373291, 373299, 373301,
        373303, 373319, 373325, 373332, 373334, 373339, 373340, 454615],
       dtype=int64),
 array([2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], dtype=int64))

# USING OF ZIP FUNCTION IN ARRAY OR LIST

In [49]:
for row, col in zip(row_indices, col_indices):
    print(f"Missing value at row {row}, column {col} ('{dt.columns[col]}')")

Missing value at row 373276, column 2 ('tag')
Missing value at row 373277, column 2 ('tag')
Missing value at row 373281, column 2 ('tag')
Missing value at row 373288, column 2 ('tag')
Missing value at row 373289, column 2 ('tag')
Missing value at row 373291, column 2 ('tag')
Missing value at row 373299, column 2 ('tag')
Missing value at row 373301, column 2 ('tag')
Missing value at row 373303, column 2 ('tag')
Missing value at row 373319, column 2 ('tag')
Missing value at row 373325, column 2 ('tag')
Missing value at row 373332, column 2 ('tag')
Missing value at row 373334, column 2 ('tag')
Missing value at row 373339, column 2 ('tag')
Missing value at row 373340, column 2 ('tag')
Missing value at row 454615, column 2 ('tag')

In [50]:
dm.isnull()

       movieId  title  genres
0        False  False   False
1        False  False   False
2        False  False   False
3        False  False   False
4        False  False   False
...        ...    ...     ...
27273    False  False   False
27274    False  False   False
27275    False  False   False
27276    False  False   False
27277    False  False   False

[27278 rows x 3 columns]

In [51]:
dm.isnull().any().any() 

#in movies data file no NAN is present IN MOVIE DATA

False

In [52]:
dr.isnull().any().any() #no NAN is present IN RATING DATA

False

**REMOVING MISSING DATA FROM TAG FILE BECAUSE ISNULL().ANY()=TRUE

In [53]:
tags_nan_remove=dt.dropna(inplace=True)

#imp note

# #tags_nan_remove=dt.dropna() remove nan spaces but when you type 
# command dt.isnull().any().any() it again give "True"

# because you remoive nan but its not automated in table we have to use
# inplace=True so that aall nan will remove

In [54]:
dt.isnull().any().any()

False

In [55]:
dt.shape

(465548, 3)

In [56]:
dt.describe()

              userId        movieId
count  465548.000000  465548.000000
mean    68710.676377   32628.389178
std     41877.408514   36080.563611
min        18.000000       1.000000
25%     28780.000000    2571.000000
50%     70201.000000    7373.000000
75%    107256.000000   62245.000000
max    138472.000000  131258.000000

In [57]:
dr.corr()

           userId   movieId    rating
userId   1.000000 -0.000850  0.001175
movieId -0.000850  1.000000  0.002606
rating   0.001175  0.002606  1.000000

In [58]:
dm

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
27273,131254,Kein Bund für's Leben (2007),Comedy
27274,131256,"Feuer, Eis & Dosenbier (2002)",Comedy
27275,131258,The Pirates (2014),Adventure
27276,131260,Rentun Ruusu (2001),(no genres listed)
27277,131262,Innocence (2014),Adventure|Fantasy|Horror

In [59]:
dm[dm['movieId']==23]

    movieId             title                 genres
22       23  Assassins (1995)  Action|Crime|Thriller

# str.contains() amazing concept

In [60]:
# list some movies which are ACTION BY genres
#with help of str.contains()
#we are accessing strings inside rows and column

action_movies=dm[dm.genres.str.contains('Action')]
action_movies.head(10)

,movieId,title,genres
5,6,Heat (1995),Action|Crime|Thriller
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller
14,15,Cutthroat Island (1995),Action|Adventure|Romance
19,20,Money Train (1995),Action|Comedy|Crime|Drama|Thriller
22,23,Assassins (1995),Action|Crime|Thriller
41,42,Dead Presidents (1995),Action|Crime|Drama
43,44,Mortal Kombat (1995),Action|Adventure|Fantasy
50,51,Guardian Angel (1994),Action|Drama|Thriller
65,66,Lawnmower Man 2: Beyond Cyberspace (1996),Action|Sci-Fi|Thriller

In [61]:
action_movies.count()

movieId    3520
title      3520
genres     3520
dtype: int64

In [62]:
#only action movie not other than that?

action_only=dm[dm.genres==('Action')]
action_only.count()

movieId    178
title      178
genres     178
dtype: int64

In [63]:
dr.head()

   userId  movieId  rating
0       1        2     3.5
1       1       29     3.5
2       1       32     3.5
3       1       47     3.5
4       1       50     3.5

In [64]:
#for highly rated movies

highly_rated=dr[dr.rating>=5]
highly_rated.head()

     userId  movieId  rating
131       1     4993     5.0
142       1     5952     5.0
158       1     7153     5.0
170       1     8507     5.0
176       2       62     5.0

In [65]:
highly_rated[30:41]

     userId  movieId  rating
239       3       50     5.0
242       3      175     5.0
244       3      223     5.0
245       3      260     5.0
246       3      316     5.0
247       3      318     5.0
248       3      329     5.0
252       3      457     5.0
253       3      480     5.0
254       3      490     5.0
256       3      541     5.0

# very good cocept
# .groupby()

In [66]:


#.groupby('kisko')['kiske saath'].count(), no change in kisko

#means it will give :
#0.5 ratings ke kitni movies id hai
# 1 ratings ke kitni movies id hai etc

dr.groupby('rating')['movieId'].count()

rating
0.5     239125
1.0     680732
1.5     279252
2.0    1430997
2.5     883398
3.0    4291193
3.5    2200156
4.0    5561926
4.5    1534824
5.0    2898660
Name: movieId, dtype: int64

In [67]:
# groupby movieId with mean of ratings

dr.groupby('movieId')['rating'].mean().head()

movieId
1    3.921240
2    3.211977
3    3.151040
4    2.861393
5    3.064592
Name: rating, dtype: float64

In [68]:
dr.groupby('movieId')['rating'].count().head()

movieId
1    49695
2    22243
3    12735
4     2756
5    12161
Name: rating, dtype: int64

In [69]:
dr.groupby('movieId')['rating'].count().head()

movieId
1    49695
2    22243
3    12735
4     2756
5    12161
Name: rating, dtype: int64

# Merging of dataframes
# merge()

In [70]:
dt.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [71]:
dm.columns

Index(['movieId', 'title', 'genres'], dtype='object')

**readable syntax

movie ko merge krdo kisme (tags main on the basis of common element 'movieId' how kaise (inner,left,right,outer)

In [72]:
merge_movie_tag=dm.merge(dt,on='movieId')
merge_movie_tag.count()

#by defalt it behave like how='inner'

movieId    465548
title      465548
genres     465548
userId     465548
tag        465548
dtype: int64

In [73]:
dm.sample(10)

,movieId,title,genres
2510,2595,Photographer (Fotoamator) (1998),Documentary
21052,102777,"Surrender, Dorothy (2006)",Drama
27005,129822,Bikes vs Cars (2015),Documentary
16588,83827,Marwencol (2010),Documentary
20729,101476,Big Girls Don't Cry... They Get Even (Stepkids...,Comedy
18778,93484,Princess of Mars (2009),Sci-Fi|Thriller|War
9828,32082,That Championship Season (1982),Drama
2132,2216,"Skin Game, The (1931)",Drama
18420,91890,"Iron Lady, The (2011)",Drama
23870,113358,Camouflage (2001),Action|Comedy

In [74]:
dt.sample(10)

        userId  movieId                           tag
459467  135399     1934                          TV-G
143337   41184     5507  ridiculous training sequence
61649    14088     8961                     animation
151827   42890     5515                    slow paced
304791   88738    58898               black and white
223906   68558     4342                           gay
110854   27898     2814                 serial killer
393260  122523    26776                 Studio Ghibli
253527   73132     5628                      teenager
77684    19356     4262                         mafia

In [75]:
dm[dm['movieId'].duplicated()]

Empty DataFrame
Columns: [movieId, title, genres]
Index: []

In [76]:
temp = dm.merge(dt[dt['userId'] == 65],on='movieId',how='inner')

In [77]:
temp[temp['movieId'].duplicated()]

,movieId,title,genres,userId,tag
28,48082,"Science of Sleep, The (La science des rêves) (...",Comedy|Drama|Fantasy|Romance,65,unusual
31,58652,CJ7 (Cheung Gong 7 hou) (2008),Children|Comedy|Sci-Fi,65,emotional
32,58652,CJ7 (Cheung Gong 7 hou) (2008),Children|Comedy|Sci-Fi,65,girls who play boys
33,58652,CJ7 (Cheung Gong 7 hou) (2008),Children|Comedy|Sci-Fi,65,Stephen Chow

In [78]:
dm.merge(dt[dt['userId'] == 65],on='movieId',how='inner')['tag'].value_counts()

tag
jesus                                 5
noir thriller                         5
dark hero                             4
bollywood                             3
mars                                  2
conspiracy theory                     2
New Zealand                           1
girls who play boys                   1
emotional                             1
cute                                  1
unusual                               1
surreal                               1
treasure                              1
Oscar (Best Foreign Language Film)    1
stranded                              1
dragon                                1
neo-noir                              1
screwball comedy                      1
Stephen Chow                          1
Name: count, dtype: int64

In [79]:
merge_movie_tag=dm.merge(dt,on='movieId',how='inner')
merge_movie_tag

##With how='inner':only intersection
#The merge will include only rows where the movieId exists in both dm and dt. 
#This is an inner join, which returns the intersection of the two data frames.

,movieId,title,genres,userId,tag
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1644,Watched
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,computer animation
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Disney animated feature
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Pixar animation
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,TÃ©a Leoni does not star in this movie
...,...,...,...,...,...
465543,131258,The Pirates (2014),Adventure,28906,bandits
465544,131258,The Pirates (2014),Adventure,28906,Korea
465545,131258,The Pirates (2014),Adventure,28906,mutiny
465546,131258,The Pirates (2014),Adventure,28906,pirates
465547,131258,The Pirates (2014),Adventure,28906,whale

In [80]:
merge_movie_tag[merge_movie_tag[['movieId','userId']].duplicated()].shape[0]

290719

In [81]:
merge_movie_tag[merge_movie_tag[['movieId','userId']].duplicated()].nunique()

movieId    13311
title      13306
genres      1083
userId      4722
tag        27367
dtype: int64

In [82]:
merge_movie_tag[merge_movie_tag[['movieId','userId']].duplicated()]['userId'].value_counts().values.sum()

290719

In [83]:
merge_movie_tag['tag'].value_counts().sort_values(ascending=False).head(10)

tag
sci-fi             3384
based on a book    3281
atmospheric        2917
comedy             2779
action             2657
surreal            2427
BD-R               2334
twist ending       2323
funny              2072
dystopia           1991
Name: count, dtype: int64

In [84]:
merge_movie_tag.head(3) #merging of movie and tag on basis of id

,movieId,title,genres,userId,tag
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1644,Watched
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,computer animation
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Disney animated feature

**diffent types of how='join' in merge()

if you want different types of joins (e.g., outer, left, or right joins), you would need to specify
them using the how parameter. Here are some options:

**how='left'**: A left join includes all rows from dm (the left data frame) and matching rows from dt.
    If there is no match in dt, the result will have NaN for columns from dt.
    
        merged_df = dm.merge(dt, on='movieId', how='left')
    
**how='right'**: A right join includes all rows from dt (the right data frame) and matching rows from dm.
    If there is no match in dm, the result will have NaN for columns from dm.
    
        merged_df = dm.merge(dt, on='movieId', how='right')
    
**how='outer'**: An outer join includes all rows from both data frames, filling in NaN where there is 
    no match.in dm and dt
    
        merged_df = dm.merge(dt, on='movieId', how='outer')

In [85]:
print(dm.columns)
print(dt.columns)
print(dr.columns)

Index(['movieId', 'title', 'genres'], dtype='object')
Index(['userId', 'movieId', 'tag'], dtype='object')
Index(['userId', 'movieId', 'rating'], dtype='object')

**now if we want ot merge dt with dr 2 columns are same 'userid' and 'movieId'
**then if we simply apply 

dm.merge(dr,on='movieId',how='inner')

then panda automatic assign 2 columns _x and _y for same data in dm an dr

In [86]:
dr

          userId  movieId  rating
0              1        2     3.5
1              1       29     3.5
2              1       32     3.5
3              1       47     3.5
4              1       50     3.5
...          ...      ...     ...
20000258  138493    68954     4.5
20000259  138493    69526     4.5
20000260  138493    69644     3.0
20000261  138493    70286     5.0
20000262  138493    71619     2.5

[20000263 rows x 3 columns]

In [184]:
# merge_tag_rating=dr.merge(dt,on='movieId',how='inner')
# merge_tag_rating.head()

# #memory issue

In [88]:
dr['movieId'] = dr['movieId'].astype('int32')
dt['movieId'] = dt['movieId'].astype('int32')

# combining all
# aggregates(column)+merging+and filter data

In [89]:
dr

          userId  movieId  rating
0              1        2     3.5
1              1       29     3.5
2              1       32     3.5
3              1       47     3.5
4              1       50     3.5
...          ...      ...     ...
20000258  138493    68954     4.5
20000259  138493    69526     4.5
20000260  138493    69644     3.0
20000261  138493    70286     5.0
20000262  138493    71619     2.5

[20000263 rows x 3 columns]

avg_rating=dr.groupby('movieId').mean()
avg_rating

here when we group by on basis of movie id , with as_index=True by default then
 movie id in resultant frame will become index automatically in **(BOLD)** nopw column 
 become index that we dont want for further data transformation thats why as_index= false will make group by column here movie_id as normal column

# concept of as_index=True / as_index=False

**as_index=True (default)**: When you do not set as_index=False, the column you group by (movieId in this case) will become the index of the resulting data frame.means the column movieId will become
index and it will create problem when to merge this data frame to other.meaning you will no longer have a movieId column, but it will still be part of the data frame as the index.

 **When you set as_index=False**, the column you group by will remain a regular column in the resulting data frame.
 eg
 
 **Accessing Values:** If you use as_index=True (the default), you have to use the index to access movieId, which can be less intuitive than simply using it as a column. For example, filtering based on movieId as an index would require slightly different syntax.

With as_index=True: 
Accessing movieId would require something 
like**avg_rating.index.**

With as_index=False:
Accessing movieId is straightforward as
**avg_rating['movieId']**.

In [90]:
avg_rating=dr.groupby('movieId',as_index=False).mean()
avg_rating.head()

#here index is not movieid we can see that in bold letters are the index

   movieId        userId    rating
0        1  69282.396821  3.921240
1        2  69169.928202  3.211977
2        3  69072.079388  3.151040
3        4  69652.913280  2.861393
4        5  69113.475454  3.064592

In [91]:
#now we dont wand avg of user id which is of no sence

avg_rating_actual=del avg_rating['userId']
avg_rating_actual

# error because always remember his causes a syntax error because
# del does not return anything that you can assign to avg_rating_actual.

# we cannot store del df[column] in any variable because its not a function
# it will not give any thing in return

SyntaxError: invalid syntax (2201540296.py, line 3)

In [94]:
#we can use drop here because drop is a function it will inreturn a data frame

avg_rating_actual=avg_rating.drop(columns=['userId'])
avg_rating_actual.head()

   movieId    rating
0        1  3.921240
1        2  3.211977
2        3  3.151040
3        4  2.861393
4        5  3.064592

In [95]:
# we can use del command to delete but it will delete column permanently from data fr`avg
avg_rating.head(2)

   movieId        userId    rating
0        1  69282.396821  3.921240
1        2  69169.928202  3.211977

In [96]:
del avg_rating['userId']
#PERMANENTLY DEL COLUMN FROM DATA FRAME

In [97]:
avg_rating.head(2)

   movieId    rating
0        1  3.921240
1        2  3.211977

In [98]:
dm.head(2)

   movieId             title                                       genres
0        1  Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
1        2    Jumanji (1995)                   Adventure|Children|Fantasy

In [99]:
# now merge dm with avg_rating on the basis of movieid how=inner(intersection) means common columns
merge_movie_avg_rating=dm.merge(avg_rating,on='movieId',how='inner')
merge_movie_avg_rating.head(2)

,movieId,title,genres,rating
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.921240
1,2,Jumanji (1995),Adventure|Children|Fantasy,3.211977

# merging of 3 data frames in single line codw

In [100]:
merge_dm_dr_dt= dm.merge(dr,on='movieId').merge(dt,on='movieId')
merge_dm_dr_dt.head(10)

#so big data to merge ,memory issue
#MemoryError: Unable to allocate 28.9 GiB for an array with shape (3879615191,) and data type int64

MemoryError: Unable to allocate 28.9 GiB for an array with shape (3879615191,) and data type int64

In [ ]:
merge_movie_avg_rating.head(5)

In [101]:
#want to calculate highest avg_rating

is_highly_rated_avg= merge_movie_avg_rating.rating>=4.0
merge_movie_avg_rating[is_highly_rated_avg].tail(5)

,movieId,title,genres,rating
26737,131250,No More School (2000),Comedy,4.0
26738,131252,Forklift Driver Klaus: The First Day on the Jo...,Comedy|Horror,4.0
26739,131254,Kein Bund für's Leben (2007),Comedy,4.0
26740,131256,"Feuer, Eis & Dosenbier (2002)",Comedy,4.0
26743,131262,Innocence (2014),Adventure|Fantasy|Horror,4.0

In [102]:
#now we want to examine our data on the basis the movie in "adventure" by genure
#and rating of that movie is >=4 how

#first we calculate movies with genure =adventure using ,str.contains'adventure')\

is_adventure=dm[dm.genres.str.contains('Adventure')]
is_adventure.head(2)

   movieId             title                                       genres
0        1  Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
1        2    Jumanji (1995)                   Adventure|Children|Fantasy

In [103]:
 is_highly_rated_avg.head(2)

0    False
1    False
Name: rating, dtype: bool

In [104]:
merge_movie_avg_rating.head()

,movieId,title,genres,rating
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.921240
1,2,Jumanji (1995),Adventure|Children|Fantasy,3.211977
2,3,Grumpier Old Men (1995),Comedy|Romance,3.151040
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,2.861393
4,5,Father of the Bride Part II (1995),Comedy,3.064592

In [105]:
# merge_movie_avg_rating[is_adventure & is_highly_rated_avg].head()

# vectoized string operation

In [106]:
dm.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [109]:
movie_genere=dm.genres.str.split('|',expand=True)
movie_genere.head()

#expand=True:
#This argument changes the behavior of str.split(). If a row has Action|Adventure|Fantasy,str.split
#it will be split into a list: ['Action', 'Adventure', 'Fantasy'].

#Instead of returning a single column with lists, it expands the split elements into separate columns.

#If a row has Action|Adventure|Fantasy, it will create three separate columns:

,0,1,2,3,4,5,6,7,8,9
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None
2,Comedy,Romance,None,None,None,None,None,None,None,None
3,Comedy,Drama,Romance,None,None,None,None,None,None,None
4,Comedy,None,None,None,None,None,None,None,None,None

In [114]:
# create a new column in which we perform some action

movie_genere['is_comedy_or_not']=dm.genres.str.contains('Comedy')
movie_genere.head()

,0,1,2,3,4,5,6,7,8,9,is_comedy_or_not
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None,True
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None,False
2,Comedy,Romance,None,None,None,None,None,None,None,None,True
3,Comedy,Drama,Romance,None,None,None,None,None,None,None,True
4,Comedy,None,None,None,None,None,None,None,None,None,True

In [115]:
dm.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [117]:
dm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27278 entries, 0 to 27277
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  27278 non-null  int64
 1   title    27278 non-null  object
 2   genres   27278 non-null  object
dtypes: int64(1), object(2)
memory usage: 639.5+ KB

In [135]:
for i in ['Toy', 'Story', (1995)]:
    print(i)

Toy
Story
1995

In [142]:
len(dm['title'])

27278

In [167]:
int('(1985)'.strip('()'))

1985

In [171]:
int(dm['title'].str.split()[0][-1].strip('()'))

1995

In [173]:
# for i in range(len(dm['title'])):
#     print(i)

In [180]:
dm['Year'] = dm['title'].str.extract(r'\((\d{4})\)')

# \(  :
Escapes the literal opening parenthesis (.
                                         
\d{4} :
Matches exactly four digits (this is assuming the year is a four-digit number, like 1995).

\)  : 
Escapes the literal closing parenthesis ).
The parentheses around \d{4} form a capturing group, which captures the four-digit year from 
within the parentheses.

In [181]:
dm

,movieId,title,genres,Year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji (1995),Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men (1995),Comedy|Romance,1995
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II (1995),Comedy,1995
...,...,...,...,...
27273,131254,Kein Bund für's Leben (2007),Comedy,2007
27274,131256,"Feuer, Eis & Dosenbier (2002)",Comedy,2002
27275,131258,The Pirates (2014),Adventure,2014
27276,131260,Rentun Ruusu (2001),(no genres listed),2001
27277,131262,Innocence (2014),Adventure|Fantasy|Horror,2014

# Thank you

In [182]:
# year = []
# for i in range(len(dm['title'])):
#     year.append(int(dm['title'].str.split()[0][-1].strip('()')))

In [183]:
# dm['movies_year']=dm.title.str.contains('\\(.*)\\')

In [ ]:
# test_merge = dr.merge(dt, on='movieId', how='inner', indicator=True)
# print(test_merge['movieId'].value_counts())

In [ ]:
age=[23,45,67]
name=['sumit','aswin','aditya']

In [ ]:
for i,j in zip(age,name):
    print(i,j)